tap "adoptopenjdk/openjdk"
tap "esolitos/ipa"
tap "hashicorp/tap"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "macoscontainers/formula"
tap "majd/repo"
tap "microsoft/git"
tap "ngrok/ngrok"
tap "zkondor/dist"
brew "act"
brew "freetype"
brew "glib"
brew "xz"
brew "zstd"
brew "antlr"
brew "ca-certificates"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "aria2"
brew "autoenv"
brew "automake"
brew "gdbm"
brew "azure-cli"
brew "binutils"
brew "bison"
brew "brew-cask-completion"
brew "caddy"
brew "chruby"
brew "libyaml"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "cowsay"
brew "curl"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "dockutil"
brew "fastlane"
brew "fd"
brew "file-formula"
brew "gcc"
brew "git"
brew "glow"
brew "gnupg"
brew "go"
brew "python@3.11"
brew "httpie"
brew "jq"
brew "just"
brew "kotlin"
brew "kubernetes-cli"
brew "lazygit"
brew "libffi"
brew "llvm"
brew "mas"
brew "mkcert"
brew "mono"
brew "mono-libgdiplus"
brew "neofetch"
brew "ninja"
brew "node"
brew "ocaml"
brew "openjdk@11"
brew "openssl@1.1"
brew "ruby-install"
brew "rustup-init"
brew "tccutil"
brew "tree"
brew "unzip"
brew "vale"
brew "vscode-langservers-extracted"
brew "wasmtime"
brew "wget"
brew "whalebrew"
brew "wimlib"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "koekeishiya/formulae/skhd"
brew "macoscontainers/formula/bindfs"
cask "adguard"
cask "alacritty"
cask "alt-tab"
cask "anaconda"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "anki"
cask "appcleaner"
cask "arc"
cask "balenaetcher"
cask "bloomrpc"
cask "bluesnooze"
cask "burp-suite"
cask "cakebrew"
cask "charles"
cask "cheatsheet"
cask "chromedriver"
cask "chromium"
cask "cleanmymac"
cask "cleanshot"
cask "cmake"
cask "dbeaver-community"
cask "devtoys"
cask "discord"
cask "displaylink"
cask "figma"
cask "firefox"
cask "flipper"
cask "flutter"
cask "font-hack-nerd-font"
cask "fork"
cask "ghidra"
cask "gimp"
cask "github"
cask "gitkraken"
cask "gpg-suite-no-mail"
cask "graphql-playground"
cask "hammerspoon"
cask "hashicorp-vagrant"
cask "hazel"
cask "hyper"
cask "ipatool"
cask "iterm2"
cask "itsycal"
cask "jetbrains-toolbox"
cask "joplin"
cask "keepassxc"
cask "krisp"
cask "lens"
cask "logi-options-plus"
cask "logitech-g-hub"
cask "logitech-options"
cask "maccy"
cask "macdown"
cask "macfuse"
cask "meetingbar"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-office"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "mockoon"
cask "monitorcontrol"
cask "mounty"
cask "nextcloud"
cask "ngrok"
cask "notion"
cask "obs"
cask "obsidian"
cask "orbstack"
cask "postman"
cask "powershell"
cask "qlcolorcode"
cask "r"
cask "rar"
cask "raycast"
cask "rectangle"
cask "redisinsight"
cask "sf-symbols"
cask "shortcat"
cask "shottr"
cask "skim"
cask "sourcetree"
cask "ssh-config-editor"
cask "stats"
cask "steam"
cask "sublime-text"
cask "tailscale"
cask "the-unarchiver"
cask "thunderbird"
cask "tomatobar"
cask "tor-browser"
cask "transmission"
cask "tsh"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "warp"
cask "wechat"
cask "whatsapp"
cask "whisky"
cask "xcodes"
cask "xquartz"
cask "zed"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "iA Writer", id: 775737590
mas "Pages", id: 409201541
vscode "4ops.terraform"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "arrterian.nix-env-selector"
vscode "beauallison.brew-services"
vscode "betajob.modulestf"
vscode "chrischinchilla.vale-vscode"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "DavidAnson.vscode-markdownlint"
vscode "DEVSENSE.composer-php-vscode"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "idleberg.applescript"
vscode "jnoortheen.nix-ide"
vscode "luanpotter.dart-import"
vscode "MichaelZhou.fleet-theme"
vscode "microsoft-dciborow.align-bicep"
vscode "mkhl.direnv"
vscode "moshfeu.diff-merge"
vscode "ms-azurecache.vscode-azurecache"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-aks-tools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "pflannery.vscode-versionlens"
vscode "pinage404.nix-extension-pack"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "run-at-scale.terraform-doc-snippets"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "smockle.xcode-default-theme"
vscode "thomaspink.theme-github"
vscode "tobias-z.vscode-harpoon"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "vscjava.vscode-gradle"
vscode "vscodevim.vim"
vscode "withfig.fig"
vscode "yzhang.markdown-all-in-one"
